bench-results/fs_redis_fdp_enabled_everysec/0/summary_5.txt
====== SET ======
  28835840 requests completed in 584.75 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.127 milliseconds (cumulative count 1)
50.000% <= 0.807 milliseconds (cumulative count 14535632)
75.000% <= 1.007 milliseconds (cumulative count 21740567)
87.500% <= 1.167 milliseconds (cumulative count 25334066)
93.750% <= 1.303 milliseconds (cumulative count 27056474)
96.875% <= 1.439 milliseconds (cumulative count 27957477)
98.438% <= 1.583 milliseconds (cumulative count 28396883)
99.219% <= 1.751 milliseconds (cumulative count 28611457)
99.609% <= 1.959 milliseconds (cumulative count 28725364)
99.805% <= 2.303 milliseconds (cumulative count 28779747)
99.902% <= 13.303 milliseconds (cumulative count 28807682)
99.951% <= 28.815 milliseconds (cumulative count 28821761)
99.976% <= 38.271 milliseconds (cumulative count 28828801)
99.988% <= 50.879 milliseconds (cumulative count 28832327)
99.994% <= 62.015 milliseconds (cumulative count 28834093)
99.997% <= 64.575 milliseconds (cumulative count 28834960)
99.998% <= 70.079 milliseconds (cumulative count 28835405)
99.999% <= 455.679 milliseconds (cumulative count 28835634)
100.000% <= 1100.799 milliseconds (cumulative count 28835737)
100.000% <= 6701.055 milliseconds (cumulative count 28835790)
100.000% <= 7675.903 milliseconds (cumulative count 28835840)
100.000% <= 7675.903 milliseconds (cumulative count 28835840)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 442)
0.257% <= 0.303 milliseconds (cumulative count 73976)
2.727% <= 0.407 milliseconds (cumulative count 786491)
9.732% <= 0.503 milliseconds (cumulative count 2806250)
18.477% <= 0.607 milliseconds (cumulative count 5327980)
33.216% <= 0.703 milliseconds (cumulative count 9578235)
50.408% <= 0.807 milliseconds (cumulative count 14535632)
63.463% <= 0.903 milliseconds (cumulative count 18300056)
75.394% <= 1.007 milliseconds (cumulative count 21740567)
83.547% <= 1.103 milliseconds (cumulative count 24091501)
90.007% <= 1.207 milliseconds (cumulative count 25954296)
93.829% <= 1.303 milliseconds (cumulative count 27056474)
96.402% <= 1.407 milliseconds (cumulative count 27798374)
97.790% <= 1.503 milliseconds (cumulative count 28198622)
98.628% <= 1.607 milliseconds (cumulative count 28440221)
99.068% <= 1.703 milliseconds (cumulative count 28567015)
99.365% <= 1.807 milliseconds (cumulative count 28652681)
99.542% <= 1.903 milliseconds (cumulative count 28703759)
99.666% <= 2.007 milliseconds (cumulative count 28739613)
99.735% <= 2.103 milliseconds (cumulative count 28759326)
99.880% <= 3.103 milliseconds (cumulative count 28801319)
99.899% <= 4.103 milliseconds (cumulative count 28806579)
99.900% <= 5.103 milliseconds (cumulative count 28807021)
99.900% <= 6.103 milliseconds (cumulative count 28807138)
99.901% <= 7.103 milliseconds (cumulative count 28807191)
99.901% <= 8.103 milliseconds (cumulative count 28807227)
99.901% <= 9.103 milliseconds (cumulative count 28807276)
99.901% <= 10.103 milliseconds (cumulative count 28807295)
99.901% <= 11.103 milliseconds (cumulative count 28807345)
99.902% <= 12.103 milliseconds (cumulative count 28807476)
99.902% <= 13.103 milliseconds (cumulative count 28807612)
99.903% <= 14.103 milliseconds (cumulative count 28807879)
99.905% <= 15.103 milliseconds (cumulative count 28808407)
99.909% <= 16.103 milliseconds (cumulative count 28809607)
99.911% <= 17.103 milliseconds (cumulative count 28810101)
99.913% <= 18.111 milliseconds (cumulative count 28810755)
99.915% <= 19.103 milliseconds (cumulative count 28811423)
99.918% <= 20.111 milliseconds (cumulative count 28812100)
99.921% <= 21.103 milliseconds (cumulative count 28813151)
99.925% <= 22.111 milliseconds (cumulative count 28814298)
99.929% <= 23.103 milliseconds (cumulative count 28815455)
99.933% <= 24.111 milliseconds (cumulative count 28816541)
99.936% <= 25.103 milliseconds (cumulative count 28817311)
99.941% <= 26.111 milliseconds (cumulative count 28818735)
99.945% <= 27.103 milliseconds (cumulative count 28819862)
99.948% <= 28.111 milliseconds (cumulative count 28820902)
99.953% <= 29.103 milliseconds (cumulative count 28822171)
99.957% <= 30.111 milliseconds (cumulative count 28823469)
99.960% <= 31.103 milliseconds (cumulative count 28824440)
99.963% <= 32.111 milliseconds (cumulative count 28825103)
99.965% <= 33.119 milliseconds (cumulative count 28825766)
99.967% <= 34.111 milliseconds (cumulative count 28826319)
99.969% <= 35.103 milliseconds (cumulative count 28826775)
99.970% <= 36.127 milliseconds (cumulative count 28827270)
99.972% <= 37.119 milliseconds (cumulative count 28827890)
99.975% <= 38.111 milliseconds (cumulative count 28828693)
99.977% <= 39.103 milliseconds (cumulative count 28829313)
99.979% <= 40.127 milliseconds (cumulative count 28829806)
99.980% <= 41.119 milliseconds (cumulative count 28830198)
99.982% <= 42.111 milliseconds (cumulative count 28830580)
99.983% <= 43.103 milliseconds (cumulative count 28830932)
99.983% <= 44.127 milliseconds (cumulative count 28831080)
99.984% <= 45.119 milliseconds (cumulative count 28831184)
99.984% <= 46.111 milliseconds (cumulative count 28831190)
99.984% <= 47.103 milliseconds (cumulative count 28831300)
99.985% <= 48.127 milliseconds (cumulative count 28831581)
99.986% <= 49.119 milliseconds (cumulative count 28831810)
99.987% <= 50.111 milliseconds (cumulative count 28832157)
99.988% <= 51.103 milliseconds (cumulative count 28832414)
99.989% <= 52.127 milliseconds (cumulative count 28832576)
99.989% <= 53.119 milliseconds (cumulative count 28832678)
99.989% <= 54.111 milliseconds (cumulative count 28832797)
99.990% <= 55.103 milliseconds (cumulative count 28832954)
99.990% <= 56.127 milliseconds (cumulative count 28833083)
99.991% <= 57.119 milliseconds (cumulative count 28833197)
99.991% <= 58.111 milliseconds (cumulative count 28833352)
99.992% <= 59.103 milliseconds (cumulative count 28833445)
99.992% <= 60.127 milliseconds (cumulative count 28833557)
99.993% <= 61.119 milliseconds (cumulative count 28833795)
99.994% <= 62.111 milliseconds (cumulative count 28834152)
99.996% <= 63.103 milliseconds (cumulative count 28834649)
99.997% <= 64.127 milliseconds (cumulative count 28834891)
99.997% <= 65.119 milliseconds (cumulative count 28835068)
99.998% <= 66.111 milliseconds (cumulative count 28835220)
99.998% <= 67.135 milliseconds (cumulative count 28835270)
99.998% <= 68.159 milliseconds (cumulative count 28835290)
99.998% <= 69.119 milliseconds (cumulative count 28835337)
99.999% <= 70.143 milliseconds (cumulative count 28835414)
99.999% <= 71.103 milliseconds (cumulative count 28835440)
99.999% <= 95.103 milliseconds (cumulative count 28835449)
99.999% <= 96.127 milliseconds (cumulative count 28835490)
99.999% <= 145.151 milliseconds (cumulative count 28835492)
99.999% <= 146.175 milliseconds (cumulative count 28835540)
99.999% <= 266.239 milliseconds (cumulative count 28835569)
99.999% <= 267.263 milliseconds (cumulative count 28835590)
99.999% <= 454.143 milliseconds (cumulative count 28835595)
99.999% <= 455.167 milliseconds (cumulative count 28835605)
99.999% <= 456.191 milliseconds (cumulative count 28835640)
99.999% <= 1095.679 milliseconds (cumulative count 28835646)
99.999% <= 1096.703 milliseconds (cumulative count 28835664)
99.999% <= 1097.727 milliseconds (cumulative count 28835665)
100.000% <= 1099.775 milliseconds (cumulative count 28835709)
100.000% <= 1100.799 milliseconds (cumulative count 28835737)
100.000% <= 1101.823 milliseconds (cumulative count 28835740)
100.000% <= 6701.055 milliseconds (cumulative count 28835790)
100.000% <= 7671.807 milliseconds (cumulative count 28835799)
100.000% <= 7675.903 milliseconds (cumulative count 28835840)
100.000% <= 7675.903 milliseconds (cumulative count 28835840)
100.000% <= 7675.903 milliseconds (cumulative count 28835840)
[...]

Summary:
  throughput summary: 49313.36 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.904     0.120     0.807     1.351     1.687  7675.903